{
  "id": "1776-commission-whitewash",
  "title": "1776 Commission - Whitewashing Slavery and Native American Genocide",
  "primaryCategory": "rewriting-history",
  "severity": "catastrophic",
  "timeline": "second-term",
  "date": "2025-01-29",
  "summary": "Trump revived the discredited 1776 Commission via executive order to mandate falsified 'patriotic education' in K-12 schools. Original 2020 report justified slavery as 'more the rule than exception throughout human history' and completely omitted Native American genocide. Commission included zero professional historians specializing in US history. Report dismissed continuing legacy of racism in service of whitewashed narrative. Criticized as propaganda designed to sanitize American atrocities. Now mandated as curriculum despite historians calling it 'sheer absurdity' and 'crime against history.'",
  "keyFacts": [
    "January 29, 2025: Trump executive order revived 1776 Commission and mandated 'patriotic education' in schools",
    "Original commission created in 2020 as response to New York Times' 1619 Project about systemic racism",
    "1776 Report justifies slavery: 'more the rule than the exception throughout human history'",
    "Report includes zero mention of Native Americans, prerevolutionary land struggles, or Indigenous genocide",
    "Commission had no historians whose work focuses on US history - drafted without professional historian input",
    "Report dismisses continuing legacy of racism and slavery's impact on modern America",
    "Critics: Nation was 'established and maintained through genocidal extermination of Indigenous peoples'",
    "Report 'seeks to whitewash and fictionalize US history as regards race and slavery'",
    "Minimizes 'huge gap between the Founders' ideals and the horrors of slavery'",
    "Human Rights Watch: 'Trump Administration's Assaults on Black History'",
    "ACLU denounced report; historians called it 'sheer absurdity' and propaganda",
    "Order mandates this falsified history be taught in federally funded K-12 schools",
    "Biden had rescinded the commission in 2021; Trump reinstated it as centerpiece of education policy"
  ],
  "sources": [
    {
      "text": "NBC News: How Trump administration's 1776 Report warps history of racism and slavery",
      "url": "https://www.nbcnews.com/news/nbcblk/how-trump-administration-s-1776-report-warps-history-racism-slavery-n1254926",
      "type": "news"
    },
    {
      "text": "World Socialist Web Site: Trump order revives 1776 Commission, mandating falsification of American history",
      "url": "https://www.wsws.org/en/articles/2025/03/22/bvgl-m22.html",
      "type": "news"
    },
    {
      "text": "Milwaukee Independent: Critics slam 1776 Commission as political ploy to whitewash American history",
      "url": "https://www.milwaukeeindependent.com/syndicated/patriotic-education-critics-slam-1776-commission-political-ploy-whitewash-american-history/",
      "type": "news"
    },
    {
      "text": "Human Rights Watch: The Trump Administration's Assaults on Black History",
      "url": "https://www.hrw.org/news/2025/04/10/trump-administrations-assaults-black-history",
      "type": "news"
    },
    {
      "text": "Jacobin: The Sheer Absurdity of Trump's 1776 Commission Report",
      "url": "https://jacobin.com/2021/01/1776-commission-report-racism",
      "type": "news"
    },
    {
      "text": "ACLU Statement on Trump Administration's 1776 Commission Report",
      "url": "https://www.aclu.org/press-releases/aclu-statement-trump-administrations-1776-commission-report",
      "type": "advocacy"
    }
  ],
  "specialTags": ["education", "slavery", "native-americans", "propaganda", "historical-erasure"]
}
