{
  "id": "alex-pretti-shooting-lies",
  "title": "Fatal Shooting of Alex Pretti - ICE Disarms Legal Gun Owner, Shoots 10 Times, Lies About It",
  "primaryCategory": "ice-enforcement",
  "severity": "catastrophic",
  "timeline": "second-term",
  "date": "2026-01-24",
  "summary": "Border Patrol agents shot and killed Alex Pretti, a 37-year-old ICU nurse and U.S. citizen, during immigration enforcement in Minneapolis. Pretti was legally carrying a registered firearm with valid concealed carry permit (Minnesota allows open carry). Video shows agents disarmed him first, then shot him approximately 10 times. DHS Secretary Kristi Noem and Trump administration claimed he 'brandished weapon,' 'reacted violently,' and agents fired 'defensive shots.' Family calls it 'sickening lies.' Videos show Pretti had phone in right hand, empty left hand raised, helping woman ICE attacked, never drew weapon. Third federal shooting in three weeks. Police chief confirmed Pretti was legal gun owner with no criminal record.",
  "keyFacts": [
    "January 24, 2026: Border Patrol agents shot and killed Alex Pretti, 37, ICU nurse at Minneapolis VA Health Care System",
    "Pretti was U.S. citizen with no criminal record, legally carrying registered firearm with valid permit to carry",
    "Minnesota allows open carry; Pretti had concealed carry permit (CCP) - fully legal",
    "Videos show Pretti was helping a woman ICE agents had pushed to the ground",
    "Multiple videos show agents disarmed Pretti FIRST - removed gun from his waistband",
    "THEN agents shot him approximately 10 times AFTER disarming him",
    "DHS Secretary Kristi Noem claimed Pretti 'brandished' weapon, 'reacted violently,' agents feared for lives",
    "Noem: 'This looks like a situation where an individual arrived to inflict maximum damage and kill law enforcement'",
    "Family statement: Administration's claims are 'sickening lies' - he was 'clearly not holding a gun when attacked'",
    "Video evidence: Pretti had phone in right hand, empty left hand raised above head while being pepper sprayed",
    "Washington Post analysis: Federal agents removed handgun from Pretti's back before shooting him",
    "No video shows Pretti brandishing or attempting to use firearm - he never drew his weapon",
    "DHS argued it's 'unlawful' for protesters to carry guns even with permits - legal experts call this 'absurd'",
    "2nd Amendment expert Rob Doar: 'You don't have to pick between which rights you exercise' (1st and 2nd Amendment)",
    "Minneapolis Police Chief Brian O'Hara confirmed Pretti was legal gun owner with valid permit, no criminal record",
    "This was third shooting by federal agents in Minnesota in less than three weeks (two fatal)",
    "Two of three 2026 Minneapolis homicides were carried out by federal immigration agents"
  ],
  "sources": [
    {
      "text": "Washington Post: Videos show agent secured gun from Pretti before fatal shooting",
      "url": "https://www.washingtonpost.com/investigations/2026/01/25/minneapolis-shooting-video-gun/",
      "type": "news"
    },
    {
      "text": "KSTP: Was Alex Pretti disarmed before he was shot? A closer look at the deadly shooting",
      "url": "https://kstp.com/kstp-news/top-news/was-alex-pretti-disarmed-before-he-was-shot-a-closer-look-at-the-deadly-shooting/",
      "type": "news"
    },
    {
      "text": "Fox 9: DHS has claimed it's unlawful for protesters to carry a gun…even with a legal permit",
      "url": "https://www.fox9.com/news/minneapolis-shooting-dhs-has-claimed-its-unlawful-protesters-carry-guneven-legal-permit",
      "type": "news"
    },
    {
      "text": "NPR: 5 things to know about the latest Minneapolis shooting",
      "url": "https://www.npr.org/2026/01/25/nx-s1-5687361/minneapolis-shooting-latest-alex-pretti",
      "type": "news"
    },
    {
      "text": "PBS NewsHour: Man shot and killed by federal officers in Minnesota was an ICU nurse",
      "url": "https://www.pbs.org/newshour/nation/man-shot-and-killed-by-federal-officers-in-minnesota-was-an-icu-nurse-his-parents-say",
      "type": "news"
    },
    {
      "text": "Al Jazeera: Who was Alex Pretti, the nurse shot dead by federal agents in Minneapolis?",
      "url": "https://www.aljazeera.com/news/2026/1/25/who-was-alex-pretti-the-nurse-shot-dead-by-federal-agents-in-minneapolis",
      "type": "news"
    },
    {
      "text": "NBC News: What we know about Alex Pretti, fatally shot by federal officers",
      "url": "https://www.nbcnews.com/news/us-news/alex-pretti-fatally-shot-federal-officers-minneapolis-identified-paren-rcna255758",
      "type": "news"
    },
    {
      "text": "CBS Minnesota: Border Patrol kills Alex Pretti; judge grants restraining order against DHS",
      "url": "https://www.cbsnews.com/minnesota/live-updates/reported-shooting-south-minneapolis-federal-agents-protesters/",
      "type": "news"
    }
  ],
  "specialTags": ["police-brutality", "ice", "gun-rights", "minnesota", "kristi-noem", "gaslighting"]
}
