{
  "id": "caribbean-drug-boat-war-crimes",
  "title": "Caribbean Drug Boat Strikes - Potential War Crimes",
  "primaryCategory": "ice-enforcement",
  "severity": "catastrophic",
  "timeline": "second-term",
  "date": "2025-09-01",
  "summary": "22+ strikes on boats have killed at least 87 people. September 2 strike: After initial strike left two survivors clinging to wreckage, follow-up strike ordered to kill them. Washington Post: Hegseth gave verbal order to 'kill everybody.' Military manual says firing on shipwrecks is illegal; experts say may constitute war crime. UK stopped sharing intelligence over concerns strikes are illegal. No evidence boats were carrying drugs or posed threat. Bipartisan congressional investigations launched.",
  "keyFacts": [
    "22+ strikes on boats have killed at least 87 people",
    "September 2 strike: After initial strike left two survivors clinging to wreckage, follow-up strike ordered to kill them",
    "Washington Post: Hegseth gave verbal order to 'kill everybody'",
    "Military manual says firing on shipwrecks is illegal",
    "Experts say may constitute war crime",
    "UK stopped sharing intelligence over concerns strikes are illegal",
    "No evidence boats were carrying drugs or posed threat",
    "Bipartisan congressional investigations launched"
  ],
  "sources": [
    {
      "text": "Washington Post: Hegseth order on first Caribbean boat strike: Kill them all",
      "url": "https://www.washingtonpost.com/national-security/2025/11/28/hegseth-kill-them-all-survivors-boat-strike/",
      "type": "investigation"
    },
    {
      "text": "NPR: Did the Trump administration commit a war crime in its attack on a Venezuelan boat?",
      "url": "https://www.npr.org/2025/12/03/nx-s1-5630324/did-the-trump-administration-commit-a-war-crime-in-its-attack-on-a-venezuelan-boat",
      "type": "news"
    },
    {
      "text": "CBS News: Trump's Venezuela boat strikes fuel war crimes allegations. Are they legal?",
      "url": "https://www.cbsnews.com/news/trump-hegseth-venezuela-boat-strikes-war-crimes-are-they-legal/",
      "type": "news"
    },
    {
      "text": "The Hill: Hegseth boat strike fallout, war crime allegations: What to know",
      "url": "https://thehill.com/policy/defense/5628265-hegseth-boat-strike-order-congress-trump/",
      "type": "news"
    }
  ],
  "specialTags": ["war-crimes", "military", "extrajudicial-killing"]
}
