{
  "id": "crt-ban-schools",
  "title": "Bans 'Critical Race Theory' to Censor Teaching About Racism",
  "primaryCategory": "rewriting-history",
  "severity": "serious",
  "timeline": "second-term",
  "date": "2025-01-29",
  "summary": "Trump signed executive order prohibiting federal funds for K-12 schools that teach critical race theory (CRT) or 'gender ideology.' Order threatens to withhold federal aid from schools discussing racism's role in American history. Problem: CRT is a graduate-level academic framework rarely taught in K-12 schools (only 8% of teachers even discussed it). Order is designed to censor any teaching about systemic racism, slavery's ongoing impacts, or uncomfortable historical truths. Codifies 'divisive concepts' definition that labels factual history as forbidden. Federal government lacks legal authority to mandate curriculum, but uses funding threats.",
  "keyFacts": [
    "January 29, 2025: Trump signed executive order prohibiting federal funds for schools teaching CRT or 'gender issues'",
    "Order 'prohibits federal funding of the indoctrination of children' including 'critical race theory in the classroom'",
    "Reality: CRT is graduate-level academic framework, not K-12 curriculum - only 8% of teachers discussed it (EdWeek 2021)",
    "CRT is 'typically taught at the collegiate and postgraduate level' and 'has been around for decades'",
    "Order's true target: Any discussion of systemic racism, slavery's legacy, or racial injustice in American history",
    "Republican Senator Risch introduced PEACE Act to codify Trump's 2020 definition of 'divisive concepts'",
    "Definition labels teaching about racism as 'divisive' and therefore forbidden",
    "Federal government is legally barred from mandating what curriculum schools use",
    "Unclear how Trump officials would track what's taught in 13,000 school districts",
    "Order reinstates 1776 Commission, telling agencies to 'prioritize advancement of patriotic education'",
    "Threatens school funding cuts for teaching accurate but 'uncomfortable' American history",
    "Part of coordinated effort with Smithsonian order, 1776 Commission, Philadelphia exhibit removal",
    "Effect: Teachers self-censor discussion of racism, slavery, Civil Rights Movement out of fear of losing funding"
  ],
  "sources": [
    {
      "text": "The Hill: Trump bans federal funds for schools teaching CRT and 'gender ideology'",
      "url": "https://thehill.com/homenews/education/5113202-trump-schools-executive-order-crt-gender-ideology/",
      "type": "news"
    },
    {
      "text": "Education Week: Trump Threatens School Funding Cuts to End 'Radical Indoctrination'",
      "url": "https://www.edweek.org/policy-politics/trump-threatens-school-funding-cuts-in-effort-to-end-radical-indoctrination/2025/01",
      "type": "news"
    },
    {
      "text": "CBS News: Trump takes aim at critical race theory in schools in new executive order",
      "url": "https://www.cbsnews.com/news/trumps-orders-critical-race-theory-college-protests/",
      "type": "news"
    },
    {
      "text": "NBC News: How Trump ignited the fight over critical race theory in schools",
      "url": "https://www.nbcnews.com/news/nbcblk/how-trump-ignited-fight-over-critical-race-theory-schools-n1266701",
      "type": "news"
    },
    {
      "text": "Chalkbeat: Trump seeks to withhold aid for schools over CRT and gender ideology",
      "url": "https://www.chalkbeat.org/2025/01/29/trump-executive-order-targets-critical-race-theory-gender-issues-in-schools/",
      "type": "news"
    },
    {
      "text": "Senator Risch Press Release: Bill to Ban Critical Race Theory in Education",
      "url": "https://www.risch.senate.gov/public/index.cfm/2025/1/risch-introduces-bill-to-ban-critical-race-theory-in-u-s-history-and-civics-education",
      "type": "government"
    }
  ],
  "specialTags": ["education", "censorship", "racism", "schools", "executive-order"]
}
