{
  "id": "dr-oz-medicare",
  "title": "Dr. Oz - TV Personality Running Medicare/Medicaid",
  "primaryCategory": "corruption",
  "severity": "serious",
  "timeline": "second-term",
  "date": "2025-01-20",
  "summary": "Trump appointed TV personality Dr. Oz with no government experience to oversee Medicare/Medicaid for 160+ million Americans. British Medical Journal study found 50% of his TV health advice was not supported or refuted by science. Up to $56 million in conflicts of interest.",
  "keyFacts": [
    "TV personality with no experience running government agencies or healthcare programs",
    "Oversees Medicare, Medicaid, CHIP, ACA marketplace for 160+ million Americans",
    "2014 British Medical Journal study: 50% of his TV health advice was not supported or refuted by scientific evidence",
    "AMA Journal of Ethics: 'A dangerous rogue unfit for the office of America's doctor'",
    "150 Pennsylvania physicians called him a 'major threat to public health'",
    "Up to $56 million invested in companies with direct CMS interests - massive conflict",
    "Co-founded health benefits company ZorroRX that could profit from CMS decisions",
    "Class action lawsuit settlement for false advertising of weight-loss products",
    "Promoted hydroxychloroquine for COVID-19 (debunked)",
    "Refused to commit to opposing Medicaid cuts under oath"
  ],
  "sources": [
    {
      "text": "Washington Post: Half of Dr. Oz's medical advice is baseless or wrong, study says",
      "url": "https://www.washingtonpost.com/news/morning-mix/wp/2014/12/19/half-of-dr-ozs-medical-advice-is-baseless-or-wrong-study-says/",
      "type": "news"
    },
    {
      "text": "ResearchGate: The Case of Dr. Oz - Ethics, Evidence, and Does Professional Self-Regulation Work? (AMA Journal of Ethics)",
      "url": "https://www.researchgate.net/publication/320876152_The_Case_of_Dr_Oz_Ethics_Evidence_and_Does_Professional_Self-Regulation_Work",
      "type": "journal"
    },
    {
      "text": "NPR: Dr. Oz invested in businesses regulated by agency Trump wants him to run",
      "url": "https://www.npr.org/sections/shots-health-news/2024/11/22/nx-s1-5201663/trump-dr-oz-investments-cms",
      "type": "news"
    },
    {
      "text": "Common Dreams: Dr. Oz Had Up to Tens of Millions Invested in Companies Involved With CMS",
      "url": "https://www.commondreams.org/news/dr-oz",
      "type": "watchdog"
    }
  ],
  "specialTags": ["conflicts-of-interest", "healthcare", "tv-personality"]
}
