{
  "id": "musk-nazi-salute",
  "title": "Musk Nazi Salute at Trump Inauguration",
  "primaryCategory": "racism",
  "severity": "serious",
  "timeline": "second-term",
  "date": "2025-01-20",
  "summary": "At Trump inauguration rally, Elon Musk placed hand on heart then extended arm outward with palm down - twice. Widely condemned in Germany where such gestures are illegal. Neo-Nazi groups celebrated it. Rep. Nadler: 'I never imagined we would see... what appears to be a Heil Hitler salute... behind the Presidential seal.'",
  "keyFacts": [
    "Placed hand on heart then extended arm outward with palm down - twice",
    "Said: 'My heart goes out to you. It is thanks to you that the future of civilization is assured'",
    "Widely condemned in Germany where such gestures are illegal",
    "Neo-Nazi and white supremacist groups celebrated it as Nazi salute",
    "Rep. Jerry Nadler: 'I never imagined we would see... what appears to be a Heil Hitler salute... behind the Presidential seal'",
    "Musk dismissed as 'dirty tricks,' then posted Nazi-themed puns and jokes on X",
    "Steve Bannon replicated salute at CPAC to applause",
    "Multiple European political parties demanded Musk be banned from their countries",
    "Holocaust memorial Yad Vashem chair condemned Musk's comments that there is 'too much focus on past guilt'"
  ],
  "sources": [
    {
      "text": "Wikipedia: Elon Musk salute controversy",
      "url": "https://en.wikipedia.org/wiki/Elon_Musk_salute_controversy",
      "type": "reference"
    },
    {
      "text": "The Hill: Nadler criticizes Musk for apparent 'Heil Hitler' salute",
      "url": "https://thehill.com/homenews/administration/5096983-nadler-heil-hitler-nazi-salute-musk-trump-inauguration-day/",
      "type": "news"
    },
    {
      "text": "NPR: Elon Musk turns Inauguration Day salute into Nazi-themed jokes",
      "url": "https://www.npr.org/2025/01/23/nx-s1-5269719/elon-musk-salute-inauguration-day-nazis",
      "type": "news"
    },
    {
      "text": "Al Jazeera: Musk accused of giving Nazi salute during Trump inauguration celebrations",
      "url": "https://www.aljazeera.com/economy/2025/1/21/musk-accused-of-giving-nazi-salute-during-trump-inauguration-celebrations",
      "type": "news"
    }
  ],
  "specialTags": ["nazi", "white-supremacy", "musk"]
}
