{
  "id": "nobel-prize-machado-controversy",
  "title": "Nobel Peace Prize Controversy - Machado Gives Medal to Trump",
  "primaryCategory": "narcissism",
  "severity": "absurd",
  "timeline": "second-term",
  "date": "2026-01-15",
  "summary": "2025 Nobel Peace Prize awarded to María Corina Machado for 'tireless work promoting democratic rights for the people of Venezuela.' Trump had longstanding desire to win, claimed it would be 'big insult' to US if he didn't win. After Machado won, White House Communications Director: 'The Nobel Committee proved they place politics over peace.' Following Venezuela invasion, Machado offered to 'share' her Nobel Prize with Trump. Nobel Committee rejected, clarifying prize 'cannot be revoked, shared or transferred.' January 15, 2026: Machado had lunch with Trump at White House and physically presented her Nobel Peace Prize medal as a gift. Trump confirmed he would keep it. Norwegian lawmakers reacted with shock. Oslo professor called it 'completely unheard of,' 'disrespectful' and 'pathetic.'",
  "keyFacts": [
    "2025 Nobel Peace Prize awarded to María Corina Machado for 'tireless work promoting democratic rights for the people of Venezuela'",
    "Trump had longstanding desire to win Nobel Peace Prize, repeatedly suggested he deserved it",
    "Trump claimed it would be 'big insult' to the US if he did not win",
    "After Machado won, White House Communications Director Steven Cheung: 'The Nobel Committee proved they place politics over peace'",
    "Richard Grenell (Trump's Venezuela envoy) declared the 'Nobel Prize died years ago'",
    "Following U.S. Venezuela invasion, Machado offered to 'share' her Nobel Prize with Trump",
    "Nobel Committee rejected the request, clarifying prize 'cannot be revoked, shared or transferred'",
    "Committee: While ownership of physical medal can change, the title does not transfer - Trump is not a Nobel Peace Prize laureate",
    "January 15, 2026: Machado had lunch meeting with Trump at White House and physically presented her Nobel Peace Prize medal as a gift",
    "Trump confirmed he would keep the medal, writing: 'Maria presented me with her Nobel Peace Prize for the work I have done'",
    "Norwegian lawmakers reacted with shock and dismay",
    "Professor Janne Haaland Matlary (University of Oslo) called it 'completely unheard of,' 'disrespectful' and 'pathetic'",
    "Matlary said it undermined the value of the prize",
    "Trump has been nominated for 2026 Nobel Peace Prize; decision to be announced October 2026"
  ],
  "sources": [
    {
      "text": "Washington Post: Machado gave her Peace Prize to Trump. Can a Nobel be gifted?",
      "url": "https://www.washingtonpost.com/politics/2026/01/16/us-trump-venezuela-machado-nobel-peace-prize-gift/",
      "type": "news"
    },
    {
      "text": "CNN: Venezuela's Machado gave Trump her Nobel prize. In return she received a swag bag but no promise of support",
      "url": "https://www.cnn.com/2026/01/15/americas/venezuela-machado-trump-meeting-nobel-intl-hnk",
      "type": "news"
    },
    {
      "text": "NBC News: María Corina Machado gives Trump her Nobel Peace Prize medal in White House visit",
      "url": "https://www.nbcnews.com/politics/white-house/venezuelas-opposition-leader-machado-visits-trump-white-house-nobel-rcna253635",
      "type": "news"
    },
    {
      "text": "CNBC: Norway shocked by Machado's move to present Nobel prize to Trump",
      "url": "https://www.cnbc.com/2026/01/16/trump-machado-norway-.html",
      "type": "news"
    },
    {
      "text": "TIME: Can a Nobel Prize Be Gifted or Sold?",
      "url": "https://time.com/7347040/nobel-peace-prize-trump-venezuela-machado-sold-gift-history/",
      "type": "analysis"
    }
  ],
  "specialTags": ["nobel-prize", "venezuela", "narcissism"]
}
