{
  "id": "presidential-walk-of-fame-plaques",
  "title": "Installed Insulting Plaques Beneath Presidential Portraits - 'Presidential Walk of Fame'",
  "primaryCategory": "narcissism",
  "severity": "serious",
  "timeline": "second-term",
  "date": "2025-12-17",
  "summary": "December 2025: Trump installed bronze plaques beneath presidential portraits along the White House West Wing Colonnade in what he calls the 'Presidential Walk of Fame.' Many plaques, reportedly written by Trump himself, contain insults and baseless claims about his predecessors. Biden's plaque calls him 'Sleepy Joe Biden' and 'the worst President in American History' - his portrait was replaced with a photo of an autopen device. Obama's plaque calls him 'one of the most divisive political figures in American History' despite having highest retrospective favorability (59%) of past five presidents. Written in Trump's social media style with random capitalization and insults. Sparked controversy over presidential decorum and use of White House for partisan attacks.",
  "keyFacts": [
    "December 2025: Trump installed bronze plaques along White House West Wing Colonnade",
    "Project called 'Presidential Walk of Fame' beneath presidential portraits",
    "Many plaques reportedly written by Trump himself",
    "Biden plaque: calls him 'Sleepy Joe Biden' and 'the worst President in American History'",
    "Biden's portrait replaced with photograph of an autopen device",
    "Obama plaque calls him 'one of the most divisive political figures in American History' despite PBS fact-check showing Obama has 59% favorability rating, highest of past five presidents (Trump: 48%)",
    "George W. Bush plaque: 'started wars in Afghanistan and Iraq, both of which should not have happened'",
    "Plaques written in style of Trump's social media posts - insults, baseless claims, random capitalization",
    "Sparked row over presidential decorum and partisan use of White House",
    "Historians and ethics experts criticized unprecedented use of White House for personal attacks",
    "Syracuse professor noted plaques violate tradition of respectful presidential transitions"
  ],
  "sources": [
    {
      "text": "ABC News: Trump hangs plaques mocking Biden, Obama along White House Colonnade",
      "url": "https://abcnews.go.com/Politics/trump-hangs-plaques-mocking-biden-obama-white-house/story?id=128492648",
      "type": "news"
    },
    {
      "text": "PBS News: Fact-checking Trump's plaques for past presidents at the White House 'Walk of Fame'",
      "url": "https://www.pbs.org/newshour/politics/fact-checking-trumps-plaques-for-past-presidents-at-the-white-house-walk-of-fame",
      "type": "fact-check"
    },
    {
      "text": "CNN: New plaques on Trump's 'Presidential Walk of Fame' offer partisan descriptions",
      "url": "https://www.cnn.com/2025/12/17/politics/presidential-walk-of-fame-plaques-trump",
      "type": "news"
    },
    {
      "text": "CBC News: New plaques insult, mock former U.S. presidents",
      "url": "https://www.cbc.ca/news/world/white-house-plaques-trump-biden-9.7020730",
      "type": "news"
    },
    {
      "text": "NBC News: White House installs plaques mocking former Presidents Barack Obama and Joe Biden",
      "url": "https://www.nbcnews.com/politics/white-house/white-house-installs-plaques-mocking-former-presidents-barack-obama-jo-rcna249746",
      "type": "news"
    },
    {
      "text": "CBS News: Trump installs partisan plaques on 'Presidential Walk of Fame' at White House",
      "url": "https://www.cbsnews.com/news/trumps-white-house-plaques-presidents/",
      "type": "news"
    },
    {
      "text": "Syracuse Maxwell School: Professor discusses plaques violating presidential tradition",
      "url": "https://www.maxwell.syr.edu/news/article/brockway-talks-to-huffpost-about-the-plaques-in-trump-s-presidential-walk-of-fame",
      "type": "expert"
    }
  ],
  "specialTags": ["white-house", "presidential-norms", "petty", "biden", "obama"]
}
