{
  "id": "rfk-jr-health-secretary",
  "title": "RFK Jr. - Anti-Vaccine Conspiracy Theorist as Health Secretary",
  "primaryCategory": "public-health",
  "severity": "catastrophic",
  "timeline": "second-term",
  "date": "2025-01-20",
  "summary": "Trump appointed RFK Jr., one of the 'Disinformation Dozen' spreading COVID vaccine misinformation, as HHS Secretary. He fired all 17 CDC vaccine advisory panel members, replaced them with anti-vax activists, removed hepatitis B vaccine recommendations. Measles reached 20-year high, unvaccinated children died.",
  "keyFacts": [
    "Named by Center for Countering Digital Hate as one of 'Disinformation Dozen' - leading spreaders of COVID vaccine misinformation",
    "No medical degree, no public health experience",
    "Promoted debunked theory linking vaccines to autism for decades",
    "Changed CDC website to suggest vaccines might cause autism after promising not to",
    "Fired all 17 members of CDC vaccine advisory panel (ACIP)",
    "Replaced them with anti-vaccine activists and conspiracy theorists",
    "New panel voted to remove hepatitis B vaccine recommendation for newborns",
    "Measles cases reached nearly 20-year high in 2025; two unvaccinated children died in Texas",
    "Pertussis cases rising; two unvaccinated children died in Kentucky",
    "Nine former CDC directors condemned Kennedy: 'Endangering every American's health'",
    "Article of impeachment filed against Kennedy in December 2025"
  ],
  "sources": [
    {
      "text": "Center for Countering Digital Hate: The Disinformation Dozen",
      "url": "https://counterhate.com/research/the-disinformation-dozen/",
      "type": "watchdog"
    },
    {
      "text": "CBS News: A dozen anti-vaccine accounts are responsible for 65% of disinformation",
      "url": "https://www.cbsnews.com/news/vaccine-disinformation-social-media-center-for-countering-digital-hate-report/",
      "type": "news"
    },
    {
      "text": "New York Times (via CBS): Former CDC directors slam RFK Jr.: 'Endangering every American's health'",
      "url": "https://www.cbsnews.com/news/cdc-directors-oped-rfk-jr-endangering-every-americans-health/",
      "type": "statement"
    },
    {
      "text": "NBC News: Former CDC directors cast RFK Jr. as 'dangerous' in New York Times guest essay",
      "url": "https://www.nbcnews.com/politics/trump-administration/former-cdc-directors-rfk-jr-dangerous-new-york-times-rcna228374",
      "type": "news"
    }
  ],
  "specialTags": ["public-health", "vaccines", "children", "disinformation"]
}
