{
  "id": "smithsonian-censorship-order",
  "title": "Executive Order to Censor Smithsonian Museums - Erase 'Divisive' History",
  "primaryCategory": "rewriting-history",
  "severity": "catastrophic",
  "timeline": "second-term",
  "date": "2025-03-27",
  "summary": "Trump signed Executive Order 14253 'Restoring Truth and Sanity to American History' targeting Smithsonian museums. Order prohibits exhibits that 'degrade shared American values, divide Americans based on race, or promote programs inconsistent with Federal law.' Specifically targets American Art Museum and National Museum of African American History and Culture for portraying 'American and Western values as inherently harmful.' Bans Women's History Museum from exhibits celebrating trans women. Order attempts government censorship of independent museums documenting accurate history. Closes Office of Diversity, freezes hiring. Attempts to erase racism from US history.",
  "keyFacts": [
    "March 27, 2025: Trump signed Executive Order 14253 'Restoring Truth and Sanity to American History'",
    "Order removes 'divisive, race-centered ideology' from Smithsonian museums, research centers, and National Zoo",
    "Prohibits exhibits that 'degrade shared American values, divide Americans based on race'",
    "Specifically targets American Art Museum and National Museum of African American History and Culture",
    "Order claims these museums promote 'narratives that portray American and Western values as inherently harmful and oppressive'",
    "Bans Women's History Museum from hosting exhibits that celebrate trans women",
    "Directs VP Vance to eliminate 'divisive race-centered ideology' from Smithsonian institutions",
    "Smithsonian announced freeze on federal hiring and closure of Office of Diversity following order",
    "Legal questions: Smithsonian's structure outside three branches arguably makes it not subject to executive orders",
    "Critics: Order attempts to 'erase racism from U.S. history' and sanitize uncomfortable truths",
    "Order labels accurate historical documentation as 'improper ideology'",
    "Part of broader pattern: Philadelphia slavery exhibit removal, 1776 Commission revival, CRT bans",
    "This is government censorship of museums documenting factual American history"
  ],
  "sources": [
    {
      "text": "NPR: Trump executive order aims to remove DEI from Smithsonian",
      "url": "https://www.npr.org/2025/03/27/nx-s1-5342914/smithsonian-president-trump-executive-order",
      "type": "news"
    },
    {
      "text": "Al Jazeera: Trump orders removal of 'improper ideology' from US museums",
      "url": "https://www.aljazeera.com/news/2025/3/28/trump-orders-removal-of-improper-ideology-from-top-us-museums",
      "type": "news"
    },
    {
      "text": "Social Work Blog: Trump order attempts to erase racism from U.S. history",
      "url": "https://www.socialworkblog.org/advocacy/2025/04/trump-smithsonian-executive-order-attempts-to-erase-racism-from-u-s-history/",
      "type": "news"
    },
    {
      "text": "NPR: How will the Smithsonian be affected by Trump's executive order?",
      "url": "https://www.npr.org/2025/03/28/nx-s1-5343524/smithsonian-trump-executive-order",
      "type": "news"
    },
    {
      "text": "Library of Congress: Smithsonian Institution - Potential Effects of Executive Order 14253",
      "url": "https://www.congress.gov/crs-product/IF12975",
      "type": "government"
    }
  ],
  "specialTags": ["museums", "censorship", "african-american-history", "executive-order", "smithsonian"]
}
