{
  "id": "trump-birthday-mlk-day-national-parks",
  "title": "Removed MLK Day & Juneteenth as Free Park Days, Added Trump's Birthday",
  "primaryCategory": "narcissism",
  "severity": "serious",
  "timeline": "second-term",
  "date": "2025-12-06",
  "summary": "Trump administration removed Martin Luther King Jr. Day and Juneteenth from 2026 calendar of entrance fee-free days for national parks. Added June 14 (Flag Day AND Trump's birthday) as fee-free day. Changes designated as 'resident-only patriotic fee-free days.' Also added Fourth of July weekend and Theodore Roosevelt's birthday. Civil rights advocates and Democratic lawmakers condemned removals as undercutting holidays honoring Black Americans. California state parks responded by offering free admission at 200+ state parks on MLK Day. Rep. Gabe Amo introduced PARK Act to block 'Trump's plan to force nation to celebrate his birthday.'",
  "keyFacts": [
    "Trump administration removed MLK Day and Juneteenth from 2026 fee-free national parks calendar",
    "Added June 14 (Flag Day AND Trump's birthday) as fee-free day",
    "MLK Day and Juneteenth were designated fee-free days by Biden administration",
    "Changes designated as 'resident-only patriotic fee-free days'",
    "Also added Fourth of July weekend and Theodore Roosevelt's birthday",
    "Removed anniversary of Great American Outdoors Act and National Public Lands Day",
    "Civil rights advocates condemned removals as undercutting holidays honoring Black Americans",
    "California state parks offered free admission at 200+ parks on MLK Day in response",
    "Private funds raised to offset cost of California's free MLK Day",
    "Rep. Gabe Amo introduced PARK Act to block 'Trump's plan to force nation to celebrate his birthday'",
    "Sparked widespread criticism from Democratic lawmakers"
  ],
  "sources": [
    {
      "text": "NPR - Fee-free calendar changes",
      "url": "https://www.npr.org/2025/12/06/g-s1-101090/national-parks-fee-free-calendar-mlk-juneteenth",
      "type": "news"
    },
    {
      "text": "CBS News - Trump birthday added, MLK Day removed",
      "url": "https://www.cbsnews.com/news/trump-administration-national-park-service-free-days-juneteenth-mlk-day/",
      "type": "news"
    },
    {
      "text": "NBC News - Alters free-entry days",
      "url": "https://www.nbcnews.com/politics/trump-administration/national-parks-trump-birthday-free-days-juneteenth-mlk-interior-rcna247734",
      "type": "news"
    },
    {
      "text": "Rep. Gabe Amo - PARK Act",
      "url": "https://amo.house.gov/press-release/amo-unveils-park-act-to-block-trump-s-plan-to-force-nation-to-celebrate-his-birthday",
      "type": "government"
    }
  ],
  "specialTags": ["racism", "vanity", "mlk-day", "juneteenth", "civil-rights"]
}
